In [4]:
import pandas as pd
import numpy as np

In [20]:
df1=pd.DataFrame([['HF',65],                 
                 ['HF',64.3],
                 ['JP',41.6],
                 ['JP',np.nan],
                 ['CE',64]],
                 columns=['CLI','FEGL'])

In [21]:
df1

  CLI  FEGL
0  HF  65.0
1  HF  64.3
2  JP  41.6
3  JP   NaN
4  CE  64.0

In [22]:
df2=pd.DataFrame([['MD',32.1],                 
                 ['JP',44],
                 ['HF',66.2]],                 
                 columns=['CLI','AVERAGE'])

In [23]:
df2

  CLI  AVERAGE
0  MD     32.1
1  JP     44.0
2  HF     66.2

In [24]:
df3=pd.merge(df1,df2, on='CLI', how='left')

In [25]:
df3

  CLI  FEGL  AVERAGE
0  HF  65.0     66.2
1  HF  64.3     66.2
2  JP  41.6     44.0
3  JP   NaN     44.0
4  CE  64.0      NaN

In [27]:
df4=pd.merge(df1,df2, on='CLI', how='right')

In [28]:
df4

  CLI  FEGL  AVERAGE
0  MD   NaN     32.1
1  JP  41.6     44.0
2  JP   NaN     44.0
3  HF  65.0     66.2
4  HF  64.3     66.2

In [29]:
df5=pd.merge(df1,df2, on='CLI', how='outer')

In [30]:
df5

  CLI  FEGL  AVERAGE
0  HF  65.0     66.2
1  HF  64.3     66.2
2  JP  41.6     44.0
3  JP   NaN     44.0
4  CE  64.0      NaN
5  MD   NaN     32.1

In [31]:
df6=pd.merge(df1,df2, on='CLI', how='inner')

In [32]:
df6

  CLI  FEGL  AVERAGE
0  HF  65.0     66.2
1  HF  64.3     66.2
2  JP  41.6     44.0
3  JP   NaN     44.0